### Plan — `objects/DATASET2` / `dev`
```
data.terraform_remote_state.infra_for_apt: Reading...
data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.infra: Read complete after 1s
data.terraform_remote_state.infra_for_apt: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bq_dataset2.google_bigquery_table.tables["DATASET2_MAIN"] will be created
  + resource "google_bigquery_table" "tables" {
      + creation_time                = (known after apply)
      + dataset_id                   = "DATASET2"
      + deletion_protection          = true
      + effective_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                         = (known after apply)
      + expiration_time              = (known after apply)
      + generated_schema_columns     = (known after apply)
      + id                           = (known after apply)
      + ignore_auto_generated_schema = false
      + last_modified_time           = (known after apply)
      + location                     = (known after apply)
      + max_staleness                = (known after apply)
      + num_bytes                    = (known after apply)
      + num_long_term_bytes          = (known after apply)
      + num_rows                     = (known after apply)
      + project                      = "qwiklabs-gcp-02-50ee4d1ce04f"
      + schema                       = jsonencode(
            [
              + {
                  + mode = "REQUIRED"
                  + name = "ID"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "COMPANY_ID"
                  + type = "STRING"
                },
              + {
                  + mode = "NULLABLE"
                  + name = "AMOUNT"
                  + type = "NUMERIC"
                },
            ]
        )
      + self_link                    = (known after apply)
      + table_id                     = "DATASET2_MAIN"
      + terraform_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + type                         = (known after apply)
    }

  # module.bq_dataset2.google_bigquery_table.views["VW_DATASET2_WITH_COMPANY"] will be created
  + resource "google_bigquery_table" "views" {
      + creation_time                = (known after apply)
      + dataset_id                   = "DATASET2"
      + deletion_protection          = true
      + effective_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                         = (known after apply)
      + expiration_time              = (known after apply)
      + generated_schema_columns     = (known after apply)
      + id                           = (known after apply)
      + ignore_auto_generated_schema = false
      + last_modified_time           = (known after apply)
      + location                     = (known after apply)
      + max_staleness                = (known after apply)
      + num_bytes                    = (known after apply)
      + num_long_term_bytes          = (known after apply)
      + num_rows                     = (known after apply)
      + project                      = "qwiklabs-gcp-02-50ee4d1ce04f"
      + schema                       = (known after apply)
      + self_link                    = (known after apply)
      + table_id                     = "VW_DATASET2_WITH_COMPANY"
      + terraform_labels             = {
          + "goog-terraform-provisioned" = "true"
        }
      + type                         = (known after apply)

      + view {
          + query          = <<-EOT
                SELECT
                  d.ID,
                  d.AMOUNT,
                  c.COMPANY_NAME
                FROM `qwiklabs-gcp-02-50ee4d1ce04f.DATASET2.DATASET2_MAIN` d
                LEFT JOIN `qwiklabs-gcp-02-50ee4d1ce04f.APT.PRC_APT_L1_COMPANY` c
                  ON d.COMPANY_ID = c.COMPANY_ID
            EOT
          + use_legacy_sql = false
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```